Revit 2026 API

# TriangleInShellComponent Constructor

---

Creates a copy of the given TriangleInShellComponent

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public TriangleInShellComponent(
	TriangleInShellComponent other
)
```
```vb
Public Sub New (
	other As TriangleInShellComponent
)
```
```cpp
public:
TriangleInShellComponent(
	TriangleInShellComponent^ other
)
```
```fsharp
new :
        other : TriangleInShellComponent -> TriangleInShellComponent
```

#### Parameters

other TriangleInShellComponent

| Exception | Condition |
| --- | --- |
| ArgumentNullException | A non-optional argument was null |

#### Reference

TriangleInShellComponent Class

Autodesk.Revit.DB Namespace